Revit 2027 API
ParameterTypeId.RebarElemLayoutRule Property
 "Layout Rule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemLayoutRule { get; }
Public Shared ReadOnly Property RebarElemLayoutRule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemLayoutRule {
	ForgeTypeId^ get ();
}
static member RebarElemLayoutRule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace